import acm.program.ConsoleProgram;
import acm.program.GraphicsProgram;

//ამოცანა 5. წრეების შეწყვილება (35 ქულა)
//დაწერეთ გრაფიკული თამაში, რომელიც გაშვებისთანავე დაამატებს CIRCLE_NUM წყვილ CIRCLE_D დიამეტრის მქონე წრეს. 
//წყვილში ორივე წრე უნდა იყოს გაფერადებული ერთი და იმავე შემთხვევითი ფერით და თითოეულისთვის უნდა შეირჩეს ცალცალკე შემთხვევითი ლოკაცია. 
//ამის შემდეგ პროგრამა იგივე პირობებით ყოველ DELAY მილიწამში ერთხელ ამატებს ახალ წყვილს, მანამ სანამ არ დასრულდება თამაში.
//თუ მომხმარებელი ერთმანეთის მიმდევრობით აკლიკებს ერთსა და იმავე ფერის წრეს, მაშინ ორივე წრე ქრება.
//გაითვალისწინეთ რომ წრეები ქრებიან მხოლოდ მაშინ როდესაც ერთმანეთის მიყოლებით ორ ერთსა და იმავე ფერის წრეს ვაკლიკავთ.
//ანუ ამ კლიკებს შორის არ უნდა მოხდეს კლიკი სხვა მესამე წრეზე ან ცარიელ ადგილზე. თამაში მთავრდება როცა ყველა წრე გაქრება დაფიდან.
//თამაშის დამთავრებისას პროგრამაც უნდა გაჩერდეს და აღარ დახატოს ახალი წრეები.
//შენიშვნა: წრეების დამატება უნდა მოხდეს ფანჯრის საზღვრებს შიგნით
public class midtermWreebisShewyvileba extends ConsoleProgram{
	public void run(){
		int b = 8;
		char a = 'a';
		char c = (char) (a + b);
		int d = a + b;
	}
}
